# TP6 : STP, OSPF, bigger infra

TP o√π on avance sur des protocoles toujours tr√®s utilis√©s, mais qu'on va trouver surtout dans des gros r√©seaux.

On consid√®re que √ßa reste des bases en admin r√©seau. Au menu donc :

- exp√©rimenter STP
  - ptite topo simple avec plusieurs switches
- exp√©rimenter OSPF
  - routage dynamique : les routeurs se partagent leurs routes
  - topo un peu plus fat
  - on en profite pour voir du DHCP Relay

> *Dans ce TP, pas de VLANs pour simplifier, et focus sur le sujet. Dans la vie r√©elle, les VLANs sont omnipr√©sents.*


## Sommaire

- [TP6 : STP, OSPF, bigger infra](#tp6--stp-ospf-bigger-infra)
  - [Sommaire](#sommaire)
  - [0. Setup](#0-setup)
  - [I. STP](#i-stp)
  - [II. OSPF](#ii-ospf)
  - [III. DHCP relay](#iii-dhcp-relay)
  - [IV. Bonus](#iv-bonus)
    - [1. ACL](#1-acl)

## 0. Setup

‚ûú **Faites chauffer GNS**

- VM Rocky pr√™te √† √™tre clon√©e
- du switch et routeur Cisco, on reste sur les images des pr√©c√©dents TPs

Hop petit hint en passant, on peut configurer le hostname des routeurs Cisco avec :

```cisco
R1# conf t
R1(config)# hostname meow
meow(config)# incroyable
```

‚ûú **Augmentez la RAM des routeurs** dans GNS, surtout celui qui est connect√© √† internet (partie II.) √† 256M

## I. STP

On va setup STP, au sein d'une topo simple pour que vous le voyiez en action.

![Topo STP](./img/topo_stp.png)

üåû **Configurer STP sur les 3 switches**

- bon c'est surtout activ√© par d√©faut en 2023
- je veux bien un `show spanning-tree`
  - y'a forc√©ment un port en √©tat *BLK* l√†

```bash
IOU1#show spanning-tree

VLAN0001
  Spanning tree enabled protocol ieee
  Root ID    Priority    32769
             Address     aabb.cc00.0100
             This bridge is the root
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec

  Bridge ID  Priority    32769  (priority 32768 sys-id-ext 1)
             Address     aabb.cc00.0100
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec
             Aging Time  300 sec

Interface           Role Sts Cost      Prio.Nbr Type
------------------- ---- --- --------- -------- --------------------------------
Et0/0               Desg FWD 100       128.1    P2p
Et0/1               Desg FWD 100       128.2    P2p
Et0/2               Desg FWD 100       128.3    P2p
```
```bash
IOU2#show spanning-tree

VLAN0001
  Spanning tree enabled protocol ieee
  Root ID    Priority    32769
             Address     aabb.cc00.0100
             Cost        100
             Port        1 (Ethernet0/0)
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec

  Bridge ID  Priority    32769  (priority 32768 sys-id-ext 1)
             Address     aabb.cc00.0200
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec
             Aging Time  300 sec

Interface           Role Sts Cost      Prio.Nbr Type
------------------- ---- --- --------- -------- --------------------------------
Et0/0               Root FWD 100       128.1    P2p
Et0/1               Desg FWD 100       128.2    P2p
Et0/2               Desg FWD 100       128.3    P2p
```
```bash
IOU3#show spanning-tree

VLAN0001
  Spanning tree enabled protocol ieee
  Root ID    Priority    32769
             Address     aabb.cc00.0100
             Cost        100
             Port        1 (Ethernet0/0)
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec

  Bridge ID  Priority    32769  (priority 32768 sys-id-ext 1)
             Address     aabb.cc00.0300
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec
             Aging Time  300 sec

Interface           Role Sts Cost      Prio.Nbr Type
------------------- ---- --- --------- -------- --------------------------------
Et0/0               Root FWD 100       128.1    P2p
Et0/1               Altn BLK 100       128.2    P2p
Et0/2               Desg FWD 100       128.3    P2p
```

üåû **Alt√©rer le spanning-tree**

- d√©sactiver juste un port de un switch pour provoquer la mise √† jour de STP

```bash
IOU1#conf t
IOU1(config)#interface Ethernet0/0
IOU1(config-if)#shutdown
IOU1(config-if)#end
*Dec  1 09:33:38.897: %LINK-5-CHANGED: Interface Ethernet0/0, changed state to administratively down
*Dec  1 09:33:39.904: %LINEPROTO-5-UPDOWN: Line protocol on Interface Ethernet0/0, changed state to down
```
- `show spanning-tree` pour voir la diff
```bash
IOU1#show spanning-tree

VLAN0001
  Spanning tree enabled protocol ieee
  Root ID    Priority    32769
             Address     aabb.cc00.0100
             This bridge is the root
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec

  Bridge ID  Priority    32769  (priority 32768 sys-id-ext 1)
             Address     aabb.cc00.0100
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec
             Aging Time  15  sec

Interface           Role Sts Cost      Prio.Nbr Type
------------------- ---- --- --------- -------- --------------------------------
Et0/1               Desg FWD 100       128.2    P2p
Et0/2               Desg FWD 100       128.3    P2p
```
```bash
IOU2#show spanning-tree

VLAN0001
  Spanning tree enabled protocol ieee
  Root ID    Priority    32769
             Address     aabb.cc00.0100
             Cost        200
             Port        2 (Ethernet0/1)
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec

  Bridge ID  Priority    32769  (priority 32768 sys-id-ext 1)
             Address     aabb.cc00.0200
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec
             Aging Time  300 sec

Interface           Role Sts Cost      Prio.Nbr Type
------------------- ---- --- --------- -------- --------------------------------
Et0/0               Desg FWD 100       128.1    P2p
Et0/1               Root FWD 100       128.2    P2p
Et0/2               Desg FWD 100       128.3    P2p
```
```bash
IOU3#show spanning-tree

VLAN0001
  Spanning tree enabled protocol ieee
  Root ID    Priority    32769
             Address     aabb.cc00.0100
             Cost        100
             Port        1 (Ethernet0/0)
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec

  Bridge ID  Priority    32769  (priority 32768 sys-id-ext 1)
             Address     aabb.cc00.0300
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec
             Aging Time  300 sec

Interface           Role Sts Cost      Prio.Nbr Type
------------------- ---- --- --------- -------- --------------------------------
Et0/0               Root FWD 100       128.1    P2p
Et0/1               Altn BLK 100       128.2    P2p
Et0/2               Desg FWD 100       128.3    P2p
```

> **R√©-activer ce port apr√®s la manip** inutile de le laisser d√©sactiv√©.

```bash
IOU1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
IOU1(config)#interface Ethernet0/0
IOU1(config-if)#no shutdown
IOU1(config-if)#
*Dec  1 10:06:51.902: %LINK-3-UPDOWN: Interface Ethernet0/0, changed state to up
*Dec  1 10:06:52.908: %LINEPROTO-5-UPDOWN: Line protocol on Interface Ethernet0/0, changed state to up
```
üåû **Alt√©rer le spanning-tree** en modifiant le co√ªt d'un lien

- modifier le co√ªt d'un lien existant pour modifier l'arbre spanning-tree

```bash
IOU2(config)#interface Ethernet0/0
IOU2(config-if)#spanning-tree vlan 1 port-priority 16
```
```bash

IOU1#show spanning-tree

VLAN0001
  Spanning tree enabled protocol ieee
  Root ID    Priority    32769
             Address     aabb.cc00.0100
             This bridge is the root
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec

  Bridge ID  Priority    32769  (priority 32768 sys-id-ext 1)
             Address     aabb.cc00.0100
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec
             Aging Time  300 sec

Interface           Role Sts Cost      Prio.Nbr Type
------------------- ---- --- --------- -------- --------------------------------
Et0/0               Desg FWD 100       128.1    P2p
Et0/1               Desg FWD 100       128.2    P2p
Et0/2               Desg FWD 100       128.3    P2p
```
```bash

IOU2#show spanning-tree

VLAN0001
  Spanning tree enabled protocol ieee
  Root ID    Priority    32769
             Address     aabb.cc00.0100
             Cost        100
             Port        1 (Ethernet0/0)
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec

  Bridge ID  Priority    32769  (priority 32768 sys-id-ext 1)
             Address     aabb.cc00.0200
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec
             Aging Time  300 sec

Interface           Role Sts Cost      Prio.Nbr Type
------------------- ---- --- --------- -------- --------------------------------
Et0/0               Root FWD 100        16.1    P2p
Et0/1               Desg FWD 100       128.2    P2p
Et0/2               Desg FWD 100       128.3    P2p
```
```bash
IOU3#show spanning-tree

VLAN0001
  Spanning tree enabled protocol ieee
  Root ID    Priority    32769
             Address     aabb.cc00.0100
             Cost        100
             Port        1 (Ethernet0/0)
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec

  Bridge ID  Priority    32769  (priority 32768 sys-id-ext 1)
             Address     aabb.cc00.0300
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec
             Aging Time  300 sec

Interface           Role Sts Cost      Prio.Nbr Type
------------------- ---- --- --------- -------- --------------------------------
Et0/0               Root FWD 100       128.1    P2p
Et0/1               Altn BLK 100       128.2    P2p
Et0/2               Desg FWD 100       128.3    P2p
```

ü¶à **`tp6_stp.pcapng`**

- capturez du trafic STP, quelques trames
- interpr√©tez les trames (rien dans le rendu √† √©crire, mais juste, fais l'effort de capter ce que les switches √©changent comme message)

[capture STP](./capture/tp6_stp.pcapng)

## II. OSPF

OSPF donc, routage dynamique.

On va se cantonner √† le setup de fa√ßon simple, et ensuite on mettra en place un service qui consomme ce routage en partie III.

![Topo OSPF](./img/topo_ospf.png)

> Ce sont les *areas* OSPF qui sont repr√©sent√©es en couleur, pas des r√©seaux. üå∏

‚ûú Tableau d'adressage

- la logique de l'adressage que je vous propose :
  - choix de masque
    - du `/24` pour les r√©seaux o√π y'a des clients
      - classique, simple
    - du `/30` pour les r√©seaux entre les routeurs
      - comme √ßa, on permet vraiment explicitement que deux IPs sur ces r√©seaux
  - choix des octets
    - `10.6.` pour les deux premiers octets
      - 10 pas chiant comme d'hab
      - 6 pour TP6 comme d'hab
    - pour le troisi√®me octet
      - entre les routeurs : `10.6.13.` l'octet qui suit :
        - 13 indique le r√©seau entre le routeur 1 et le routeur 3
        - 13 et pas 31 parce que je lis de gauche √† droite perso
      - r√©seaux clients : `10.6.1.`
        - arbitraire, y'a un r√©seau 1, un r√©seau 2, etc.

| Node          | `10.6.1.0/24` | `10.6.2.0/24` | `10.6.3.0/24` | `10.6.41.0/30` | `10.6.13.0/30` | `10.6.21.0/30` | `10.6.23.0/30` | `10.6.52.0/30` |
| ------------- | ------------- | ------------- | ------------- | -------------- | -------------- | -------------- | -------------- | -------------- |
| `waf.tp6.b1`  | `10.6.1.11`   | ‚ùå            | ‚ùå            | ‚ùå             | ‚ùå             | ‚ùå             | ‚ùå             | ‚ùå             |
| `dhcp.tp6.b1` | `10.6.1.253`  | ‚ùå            | ‚ùå            | ‚ùå             | ‚ùå             | ‚ùå             | ‚ùå             | ‚ùå             |
| `meo.tp6.b1`  | ‚ùå            | `10.6.2.11`   | ‚ùå            | ‚ùå             | ‚ùå             | ‚ùå             | ‚ùå             | ‚ùå             |
| `john.tp6.b1` | ‚ùå            | ‚ùå            | `10.6.3.11`   | ‚ùå             | ‚ùå             | ‚ùå             | ‚ùå             | ‚ùå             |
| `R1`          | ‚ùå            | ‚ùå            | `10.6.3.254`  | `10.6.41.1`    | `10.6.13.1`    | `10.6.21.1`    | ‚ùå             | ‚ùå             |
| `R2`          | ‚ùå            | ‚ùå            | ‚ùå            | ‚ùå             | ‚ùå             | `10.6.21.2`    | `10.6.23.2`    | `10.6.52.2`    |
| `R3`          | ‚ùå            | ‚ùå            | ‚ùå            | ‚ùå             | `10.6.13.2`    | ‚ùå             | `10.6.23.1`    | ‚ùå             |
| `R4`          | `10.6.1.254`  | `10.6.2.254`  | ‚ùå            | `10.6.41.2`    | ‚ùå             | ‚ùå             | ‚ùå             | ‚ùå             |
| `R5`          | ‚ùå            | ‚ùå            | ‚ùå            | ‚ùå             | ‚ùå             | ‚ùå             | ‚ùå             | `10.6.52.1`    |

üåû **Montez la topologie**

- IP statiques sur tout le monde
  - assurez-vous que les pings passent au sein de chacun des LANs
  - au fur et √† mesure que vous configurez
- configuration d'un NAT sur le routeur connect√© √† internet
- **aucune route statique ne doit √™tre ajout√©e nulle part**
- d√©finissez aux clients (VPCS ou VMs) des IPs statiques et d√©finissez leur gateway
  - ils auront toujours pas internet, car leur routeur n'a pas internet !
- aucune configuration particuli√®re √† faire sur `dhcp.tp6.b2` pour le moment, on fera √ßa en partie III.
  - juste une IP statique, pas de setup particulier

‚ûú Bref...

- IP statiques partout
- clients avec une gateway d√©finie
- et un NAT sur le routeur de bordurec

```bash
waf.tp6.b1> sh ip

NAME        : waf.tp6.b1[1]
IP/MASK     : 10.6.1.11/24
GATEWAY     : 10.6.1.254
DNS         :
MAC         : 00:50:79:66:68:02
LPORT       : 20004
RHOST:PORT  : 127.0.0.1:20005
MTU         : 1500

dhcp.tp6.b1> sh ip

NAME        : dhcp.tp6.b1[1]
IP/MASK     : 10.6.1.253/24
GATEWAY     : 10.6.1.254
DNS         :
MAC         : 00:50:79:66:68:03
LPORT       : 20002
RHOST:PORT  : 127.0.0.1:20003
MTU         : 1500

meo.tp6.b1> sh ip

NAME        : meo.tp6.b1[1]
IP/MASK     : 10.6.2.11/24
GATEWAY     : 10.6.2.254
DNS         :
MAC         : 00:50:79:66:68:00
LPORT       : 20006
RHOST:PORT  : 127.0.0.1:20007
MTU         : 1500

john.tp6.b1> sh ip

NAME        : john.tp6.b1[1]
IP/MASK     : 10.6.3.11/24
GATEWAY     : 10.6.3.254
DNS         :
MAC         : 00:50:79:66:68:01
LPORT       : 20008
RHOST:PORT  : 127.0.0.1:20009
MTU         : 1500

R1#sh ip int br
Interface                  IP-Address      OK? Method Status                Protocol
FastEthernet0/0            10.6.21.1       YES manual up                    up
FastEthernet0/1            10.6.13.1       YES manual up                    up
FastEthernet1/0            10.6.41.1       YES manual up                    up
FastEthernet2/0            10.6.3.254      YES manual up                    up

R2#sh ip int br
Interface                  IP-Address      OK? Method Status                Protocol
FastEthernet0/0            10.6.21.2       YES manual up                    up
FastEthernet0/1            10.6.23.2       YES manual up                    up
FastEthernet1/0            10.6.52.2       YES manual up                    up
FastEthernet2/0            unassigned      YES unset  up                    up

R3#sh ip int br
Interface                  IP-Address      OK? Method Status                Protocol
FastEthernet0/0            10.6.13.2       YES manual up                    up
FastEthernet0/1            10.6.23.1       YES manual up                    up
FastEthernet1/0            unassigned      YES unset  up                    up
FastEthernet2/0            unassigned      YES unset  up                    up

R4#sh ip int br
Interface                  IP-Address      OK? Method Status                Protocol
FastEthernet0/0            10.6.41.2       YES manual up                    up
FastEthernet0/1            10.6.1.254      YES manual up                    up
FastEthernet1/0            10.6.2.254      YES manual up                    up
FastEthernet2/0            unassigned      YES unset  up                    up

R5#sh ip int br
Interface                  IP-Address      OK? Method Status                Protocol
FastEthernet0/0            192.168.122.93  YES DHCP   up                    up
FastEthernet0/1            10.6.52.1       YES manual up                    up
FastEthernet1/0            unassigned      YES unset  up                    up
FastEthernet2/0            unassigned      YES unset  up                    up

R5#ping 1.1.1.1

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 1.1.1.1, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 20/28/40 ms
```

On va pas ajouter toutes les routes sur tous les routeurs, ce serait une giga plaie √† faire, √† maintenir, et peu r√©silient.

OSPF donc.

üåû **Configurer OSPF sur tous les routeurs**

- tous les routeurs doivent partager tous les r√©seaux auxquels ils sont connect√©s
- un petit `show running-config` o√π vous enlevez ce que vous n'avez pas tap√© pour le rendu !
- et un `show ip ospf neighbor` + `show ip route` sur chaque routeur

> R√©f√©rez-vous [au m√©mo Cisco](../../../cours/memo/cisco.md) pour les commandes OSPF.

üåû **Test**

- faites des `ping` dans tous les sens
- c'est simple hein : normalement tout le monde peut ping tout le monde
- et m√™me tout le monde a internet y compris les clients
- mettez moi quelques `ping` dans le compte-rendu

ü¶à **`tp6_ospf.pcapng`**

- capturez des BPDUs l√† o√π vous voulez
- interpr√©tez les BPDUs

> *Un BPDU c'est juste le nom qu'on donne √† une trame OSPF √©chang√©e entre deux routeurs.*

## III. DHCP relay

‚ûú **Un probl√®me tr√®s r√©current pour pas dire omnipr√©sent avec DHCP c'est que √ßa marche que dans un LAN.**

Si t'as un serveur DHCP, et plein de r√©seaux comme c'est le cas ici, c'est le bordel :

- un DHCP Request, qui part en broadcast ne passe pas un routeur
- en effet, pour changer de r√©seau, il faut construire des paquets IP
- hors quand tu fais ton DHCP Request c'est √ßa que tu cherches : avoir une IP
- dans notre topo actuelle, impossible que John contacte le serveur DHCP

‚ûú **DHCP Relay !**

- on va demander √† un routeur, s'il re√ßoit des trames DHCP de les faire passer vers notre serveur DHCP
- si le serveur DHCP le supporte, il r√©pondra donc au routeur, qui fera passer au client

üåû **Configurer un serveur DHCP** sur `dhcp.tp6.b1`

- m√™me setup que d'habitude [(c'est ce lien que tu cherches ?)](https://www.server-world.info/en/note?os=Rocky_Linux_8&p=dhcp&f=1)
- votre serveur DHCP donne des IPs dans les r√©seaux
  - `10.6.1.0/24`
    - de `10.6.1.100` √† `10.6.1.200`
    - informe les clients de l'adresse de la passerelle de ce r√©seau
    - informe les clients de l'adresse d'un serveur DNS : `1.1.1.1`
  - `10.6.3.0/24`
    - de `10.6.3.100` √† `10.6.3.200`
    - informe les clients de l'adresse de la passerelle de ce r√©seau
    - informe les clients de l'adresse d'un serveur DNS : `1.1.1.1`
- pour le compte-rendu √ßa me suffit :
  - `sudo cat /etc/dhcp/dhcpd.conf`
  - `systemctl status dhcpd`

üåû **Configurer un DHCP relay sur la passerelle de John**

- v√©rifier que Waf et John peuvent r√©cup√©rer une IP en DHCP
- check les logs du serveur DHCP pour voir les DORA
  - je veux ces 4 lignes de logs dans le compte-rendu
  - pour John et pour Waf
- la conf sur le routeur qui est la passerelle de John c'est :

```cisco
R1#conf t
R1(config)#interface fastEthernet 2/0 # interface qui va recevoir des requ√™tes DHCP
R1(config-if)#ip helper-address <DHCP_SERVER_IP_ADDRESS>
```

> *Ui c'est tout. Bah... quoi de plus ? Il a juste besoin de savoir √† qui faire passer les requ√™tes !*

## IV. Bonus

### 1. ACL

C'est un peu moche que les clients puissent `ping` les IPs des routeurs de l'autre c√¥t√© de l'infra.

Normalement, il peut joindre sa passerelle, internet, √©puic√©tou.

üåû **Configurer une access-list**

- √ßa se fait sur les routeurs
- le but :
  - les clients peuvent ping leur passerelle
  - et internet
  - √©puic√©tou
